# dotfiles/Brewfile
tap "adoptopenjdk/openjdk"
tap "clojure/tools"
tap "facebook/fb"
tap "homebrew/cask"

brew "cask"
brew 'wget'
brew 'fzf'
brew 'gh'
brew 'git-lfs'
brew 'gradle'
brew 'protobuf'
brew 'lazygit'
brew 'tmux'
brew 'pre-commit'
brew 'asdf'
# Languages
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ruby-build'
brew 'node'
# iOS
brew 'chisel'
brew 'xcodegen'
brew 'fastlane'
brew 'swiftlint'

# Applications
cask_args appdir: '/Applications'
cask '1password'
cask 'alfred'
cask 'google-chrome'
cask 'android-studio'
cask 'intellij-idea-ce'
cask 'visual-studio-code'
cask 'notion'
cask 'slack'
cask 'fig'

