# dotfiles/Brewfile

# Taps
# tap 'homebrew/cask-cask'

# Binaries/Libraries
# brew 'zsh'
# brew 'git'
brew 'chisel'
brew 'fastlane'
brew 'git-lfs'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'ruby-build'
brew 'swiftlint'
brew 'wget'
brew 'xcodegen'
brew 'protobuf'

# Applications
cask_args appdir: '/Applications'
cask '1password'
cask 'alfred'
cask 'android-studio'
cask 'google-chrome'
cask 'iterm2'
cask 'notion'
cask 'slack'
cask 'sourcetree'
cask 'visual-studio-code'
