# dotfiles/Brewfile
tap "homebrew/cask"

brew "cask"
brew 'wget'
brew 'fzf'
brew 'gh'
brew 'git-lfs'
brew 'gradle'
brew 'protobuf'
brew 'lazygit'
brew 'tmux'
brew 'asdf'
brew 'powerlevel10k'

# Applications
cask_args appdir: '/Applications'
cask '1password'
cask 'google-chrome'
cask 'intellij-idea-ce'
cask 'visual-studio-code'
cask 'dbeaver-community'
cask 'docker'
cask 'notion'
cask 'notion-calendar'
cask 'slack'
cask 'raycast'
cask 'alt-tab'

